**C1
use "D:\STATApractice\401K.DTA"

**1.
mean prate mrate
/*
Mean estimation                   Number of obs   =      1,534

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
       prate |   87.36291   .4268091      86.52572     88.2001
       mrate |   .7315124   .0199033      .6924718     .770553
--------------------------------------------------------------
解得 平均参与率为87.363%【注意prate的数值为percent数值】
平均匹配率为73.151%  */

**2.
reg prate mrate
/*

      Source |       SS           df       MS      Number of obs   =     1,534
-------------+----------------------------------   F(1, 1532)      =    123.68
       Model |  32001.7271         1  32001.7271   Prob > F        =    0.0000
    Residual |  396383.812     1,532   258.73617   R-squared       =    0.0747
-------------+----------------------------------   Adj R-squared   =    0.0741
       Total |  428385.539     1,533  279.442622   Root MSE        =    16.085

------------------------------------------------------------------------------
       prate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       mrate |   5.861079   .5270107    11.12   0.000      4.82734    6.894818
       _cons |   83.07546   .5632844   147.48   0.000     81.97057    84.18035
------------------------------------------------------------------------------
结果 prate（hat）=5.861*mrate+83.075
R-squared为0.0747，解释能力十分弱。
*/

**3.
*截距的含义是所有工人都不参与这个计划时候（也就是说计划匹配率为0的时候），就有83%的工人拥有活动账户。
*mrate的系数是说当计划匹配率提升0.1时，整体工人拥有活动账户的比例将提高0.59%。

**4.解释能力0.0747，是十分弱的量。


**C3
clear

use "D:\STATApractice\SLEEP75.DTA"
reg sleep totwrk
/*
      Source |       SS           df       MS      Number of obs   =       706
-------------+----------------------------------   F(1, 704)       =     81.09
       Model |  14381717.2         1  14381717.2   Prob > F        =    0.0000
    Residual |   124858119       704  177355.282   R-squared       =    0.1033
-------------+----------------------------------   Adj R-squared   =    0.1020
       Total |   139239836       705  197503.313   Root MSE        =    421.14

------------------------------------------------------------------------------
       sleep |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      totwrk |  -.1507458   .0167403    -9.00   0.000    -.1836126    -.117879
       _cons |   3586.377   38.91243    92.17   0.000     3509.979    3662.775
------------------------------------------------------------------------------
方程：sleep=-0.1507*totwrk+3586.377
观测次数706，观测值较多
R方0.1033，解释能力较低。
截距代表一周中没有一分钟在用于有酬工作的情况下，人们也评价会花3586.377min/week在睡觉上。

**2
totwrk增加2h（120min），sleep将减少0.1507*120=18.08min，我认为这不是一个很大的效应。
因为大家的有酬工作时间几乎都有一个范围，就是波动比较小，不太可能一周有几十小时的波动（除非是不工作转向工作）。所以减少几小时的睡眠一周不是一个特别大的效应。
*/


**C6
clear
use "D:\STATApractice\MEAP93.DTA"
**1我认为不是，经济学中常说边际效用递减，我觉得在此处也是适用的。
*初期花费的美元能够带来较高的边际收益，因为可能你对知识的掌握程度比较低，但是随着你花的钱越多，带来的边际收益就越低了。

**3
reg math10 lexpend
/*

      Source |       SS           df       MS      Number of obs   =       408
-------------+----------------------------------   F(1, 406)       =     12.41
       Model |  1329.42517         1  1329.42517   Prob > F        =    0.0005
    Residual |  43487.7553       406  107.112698   R-squared       =    0.0297
-------------+----------------------------------   Adj R-squared   =    0.0273
       Total |  44817.1805       407  110.115923   Root MSE        =     10.35

------------------------------------------------------------------------------
      math10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lexpend |   11.16439   3.169011     3.52   0.000     4.934677    17.39411
       _cons |   -69.3411   26.53013    -2.61   0.009    -121.4947   -17.18753
------------------------------------------------------------------------------
观测值408，R方0.0297，解释能力十分弱。
方程： math10=11.164*lexpend-69.341
*/

**4
*估计花销的影响为1.1164；也就是说当expend增加10%的时候，math10估计增长1.1164%。

 sum math10
/*
    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      math10 |        408    24.10686    10.49361        1.9       66.7

可以看出，math10的最大值为66.7，离100较远，所以回归分析后，有较小可能得到比100大的估值。
*/
